tests_correct = [
    (["3", "4", "+"], 7),                   # 3 + 4
    (["10", "2", "-"], 8),                  # 10 - 2
    (["3", "4", "2", "*", "+"], 11),        # 3 + 4*2
    (["5", "1", "2", "+", "4", "*", "+", "3", "-"], 14), # 5 + (1+2)*4 - 3
    (["2", "10", "**"], 1024),              # 2 ** 10
    (["3.5", "2", "*"], 7.0),               # дробные числа
    (["10", "3", "/"], 10/3),               # деление float
    (["10", "3", "//"], 3),                 # целочисленное деление
    (["10", "3", "%"], 1),                  # остаток от деления
    (["3"], 3),                             # одно число
    (["~3"], -3),                           # число с унарным минусом
    (["%3"], 3)                             # число с унарным плюсом
]

tests_zero_division = [
    (["3", "0", "/"], ZeroDivisionError), # деление на 0
    (["3", "0", "//"], ZeroDivisionError), # деление на 0
    (["3", "0", "%"], ZeroDivisionError), # остаток от деления на 0
]

tests_type_error = [
    (["3.5", "2", "//"], TypeError), # float для деления
    (["3.5", "2", "%"], TypeError), # float для остатка от деления
]

tests_large_power = [
    (["2", str(10**9), "**"], float('inf')),  # > MAX_POWER
]

tests_syntax_error = [
    (["3", "+"], SyntaxError),             # недостаточно аргументов
    (["3", "4", "&"], SyntaxError),        # неизвестная операция
    ([], SyntaxError),                     # пустое выражение
    (["3", "4", "+", "5"], SyntaxError),   # слишком много чисел
]

tests_parentheses_valid = [
    (["(", "3", "4", "+", ")"], 7),            # скобки вокруг операции
    (["2", "(", "3", "4", "*", ")", "+"], 14), # вложенные скобки в конце выражения
    (["(", "3", "4", "*", ")","2", "+"], 14), # вложенные скобки вначале выражения
    (["2", "3", "+", "(", "3", "4", "*", ")", "3", "+", '+'], 20), # вложенные скобки внутри выражения
]

tests_parentheses_invalid = [
    (["(", "3", "4", "+"], SyntaxError),       # открыта без закрытия
    (["3", "4", "+", ")"], SyntaxError),       # закрыта без открытия
    (["(", "2", "+", "3", ")", ")"], SyntaxError), # лишняя закрывающая
    (["(", "(", "2", "+", "3", ")"], SyntaxError),  # лишняя открывающая
    ([")", "2", "3", "+", "("], SyntaxError),   # скобки в неправильном порядке
]
